title: APT29 Detection
description: This rule detects suspicious execution of rundll32 that could lead to APT29's activity
author: Ariel Millahuel
reference:
- https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://app.any.run/tasks/45f2e392-6f62-408d-88b0-435aa0e73a98/
status: stable
tags:
- attack.T1059.
- attack.T1059.003
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|contains:
    - 'rundll32.exe'
    CommandLine|contains|all:
    - 'Documents'
    - '.dll'
    - ','
    - 'Open'
  condition: selection
falsepositives:
- none
level: high
